LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_eth.h
/**
  ******************************************************************************
  * @file    gd32f20x_eth.h
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   ETH header file of the firmware library.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GD32F20X_ETH_H
#define __GD32F20X_ETH_H
#define IF_USE_EXTERNPHY_LIB        0

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "gd32f20x.h"
#if (1 == IF_USE_EXTERNPHY_LIB)
#include "phy.h"
#endif
     
/** @addtogroup GD32F20x_Firmware
  * @{
  */

/** @addtogroup ETH
  * @{
  */
     
/** @defgroup ETH_Exported_Types
  * @{
  */

/** 
  * @brief  ETH MAC Initial Parameters
  */ 
typedef struct {
/** 
  * @brief / * MAC  
  */                                                      
    uint32_t             ETH_MAC_AutoNegotiation;             /*!< Enable or disable external PHY's AutoNegotiation function
                                                                 detailed in @ref ETH_AutoNegotiation */
                                                           
    uint32_t             ETH_MAC_Watchdog;                    /*!< Enable or disable the Watchdog timer
                                                                 detailed in @ref ETH_watchdog */  

    uint32_t             ETH_MAC_Jabber;                      /*!< Enable or disable Jabber timer
                                                                 detailed in @ref ETH_Jabber */

    uint32_t             ETH_MAC_InterFrameGap;               /*!< Set the gap of two frames when transmission
                                                                 detailed in @ref ETH_Inter_Frame_Gap */   

    uint32_t             ETH_MAC_CarrierSense;                /*!< Enable or disable the Carrier Sense
                                                                 detailed in @ref ETH_Carrier_Sense */

    uint32_t             ETH_MAC_Speed;                       /*!< Set the Ethernet speed, detailed in @ref ETH_Speed */
                                                                 
    
    uint32_t             ETH_MAC_ReceiveOwn;                  /*!< Enable or disable the ReceiveOwn mode
                                                                 detailed in @ref ETH_Receive_Own */  

    uint32_t             ETH_MAC_LoopbackMode;                /*!< Enable or disable the MAC Loopback mode
                                                                 detailed in @ref ETH_Loop_Back_Mode */  

    uint32_t             ETH_MAC_Mode;                        /*!< Set the MAC duplex mode, detailed in @ref ETH_Duplex_Mode */  

    uint32_t             ETH_MAC_ChecksumOffload;             /*!< Enable or disable the IPv4(TCP/UDP/ICMP headers) checksum checking when reception
                                                                 detailed in @ref ETH_Checksum_Offload */    

    uint32_t             ETH_MAC_RetryTransmission;           /*!< Enable or disable the MAC attempt retries transmission in Half-Duplex mode when a colision occurs
                                                                 detailed in @ref ETH_Retry_Transmission */

    uint32_t             ETH_MAC_AutomaticPadCRCDrop;         /*!< Enable or disable the Automatic Pad/CRC Drop
                                                                 detailed in @ref ETH_Automatic_Pad_CRC_Drop */ 

    uint32_t             ETH_MAC_BackOffLimit;                /*!< Set the BackOff limit value, detailed in @ref ETH_Back_Off_Limit */

    uint32_t             ETH_MAC_DeferralCheck;               /*!< Enable or disable the deferral check function only in Half-Duplex mode
                                                                 detailed in @ref ETH_Deferral_Check */                                                                                                        

    uint32_t             ETH_MAC_FilterDisable;               /*!< Enable or disable the MAC filter, detailed in @ref ETH_Filter_Disable */   

    uint32_t             ETH_MAC_SourceAddrFilter;            /*!< Set the SA Filter mode, detailed in @ref ETH_Source_Addr_Filter */                  

    uint32_t             ETH_MAC_PassControlFrames;           /*!< Set the mode of the control frames (including unicast and multicast PAUSE frames)                                                          
                                                                 detailed in @ref ETH_Pass_Control_Frames */ 

    uint32_t             ETH_MAC_BroadcastFramesReception;    /*!< Enable or disable the reception of Broadcast Frames
                                                                 detailed in @ref ETH_Broadcast_Frames_Reception */

    uint32_t             ETH_MAC_DestinationAddrFilter;       /*!< Set the DA filter mode, detailed in @ref ETH_Destination_Addr_Filter */ 

    uint32_t             ETH_MAC_PromiscuousMode;             /*!< Enable or disable the Promiscuous Mode
                                                                 detailed in @ref ETH_Promiscuous_Mode */

    uint32_t             ETH_MAC_MulticastFramesFilter;       /*!< Set the Multicast Frames filter mode
                                                                 detailed in @ref ETH_Multicast_Frames_Filter */ 

    uint32_t             ETH_MAC_UnicastFramesFilter;         /*!< Set the Unicast Frames filter mode
                                                                 detailed in @ref ETH_Unicast_Frames_Filter */ 

    uint32_t             ETH_MAC_HashListHigh;                /*!< Hash list higher 32 bits */

    uint32_t             ETH_MAC_HashListLow;                 /*!< Hash list lower 32 bits */

    uint32_t             ETH_MAC_PauseTime;                   /*!< Set the Pause Time field value in the transmit control frame */

    uint32_t             ETH_MAC_ZeroQuantaPause;             /*!< Enable or disable the automatic generation of Zero-Quanta Pause Control frames
                                                                 detailed in @ref ETH_Zero_Quanta_Pause */  

    uint32_t             ETH_MAC_PauseLowThreshold;           /*!< Set the threshold of the PAUSE to be checked for
                                                                 automatic retransmission of PAUSE Frame
                                                                 detailed in @ref ETH_Pause_Low_Threshold */
  
