LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_eth.h
    uint32_t             ETH_MAC_FlowControlDeactiveThreshold;/*!< Set the threshold of the deactive flow control 
                                                                 detailed in @ref ETH_RFD_Threshold  */
  
    uint32_t             ETH_MAC_FlowControlActiveThreshold;  /*!< Set the threshold of the active flow control 
                                                                 detailed in @ref ETH_RFA_Threshold  */
  
    uint32_t             ETH_MAC_UnicastPauseFrameDetect;     /*!< Enable or disable the unicast Pause frames detection
                                                                 detailed in @ref ETH_Unicast_Pause_Frame_Detect */

    uint32_t             ETH_MAC_ReceiveFlowControl;          /*!< Enable or disable the MAC to received Pause frame 
                                                                 detailed in @ref ETH_Receive_Flow_Control */

    uint32_t             ETH_MAC_TransmitFlowControl;         /*!< Enable or disable the MAC to transmit Pause frames in Full-Duplex mode
                                                                 or back-pressure operation in Half-Duplex mode
                                                                 detailed in @ref ETH_Transmit_Flow_Control */     

    uint32_t             ETH_MAC_VLANTagComparison;           /*!< Set VLAN tag comparison and filtering mode
                                                                 detailed in @ref ETH_VLAN_Tag_Comparison */ 

    uint32_t             ETH_MAC_VLANTagIdentifier;           /*!< Set VLAN tag identifier for receive frames */

/** 
  * @brief / * DMA  
  */ 

    uint32_t             ETH_DMA_DropTCPIPChecksumErrorFrame; /*!< Enable or disable the TCP/IP Checksum Error Frames drop
                                                                 detailed in @ref ETH_Drop_TCP_IP_Checksum_Error_Frame */ 

    uint32_t             ETH_DMA_ReceiveStoreForward;         /*!< Set the Rx FIFO operation mode
                                                                 detailed in @ref ETH_Receive_Store_Forward */ 

    uint32_t             ETH_DMA_FlushReceivedFrame;          /*!< Enable or disable the flushing Receive FIFO
                                                                 detailed in @ref ETH_Flush_Received_Frame */ 

    uint32_t             ETH_DMA_TransmitStoreForward;        /*!< Enable or disable Tx FIFO operation mode
                                                                 detailed in @ref ETH_Transmit_Store_Forward */ 

    uint32_t             ETH_DMA_TransmitThresholdControl;    /*!< Enable or disable the Transmit Threshold Control and set the level
                                                                 detailed in @ref ETH_Transmit_Threshold_Control */

    uint32_t             ETH_DMA_ForwardErrorFrames;          /*!< Enable or disable receive the erroneous frames to the DMA
                                                                 detailed in @ref ETH_Forward_Error_Frames */

    uint32_t             ETH_DMA_ForwardUndersizedGoodFrames; /*!< Enable or disable receive the Undersized frames with no Error
                                                                 and length less than 64 bytes including pad-bytes and CRC to the DMA
                                                                 detailed in @ref ETH_Forward_Undersized_Good_Frames */

    uint32_t             ETH_DMA_ReceiveThresholdControl;     /*!< Enable or disable the Receive Threshold Control and set the level
                                                                 detailed in @ref ETH_Receive_Threshold_Control */

    uint32_t             ETH_DMA_SecondFrameOperate;          /*!< Enable or disable the Operate on second frame mode
                                                                 detailed in @ref ETH_Second_Frame_Operate */

    uint32_t             ETH_DMA_AddressAligned;              /*!< Enable or disable the Address Aligned 
                                                                 detailed in @ref ETH_Address_Aligned */

    uint32_t             ETH_DMA_FixedBurst;                  /*!< Enable or disable the AHB Master interface fixed burst transfers
                                                                 detailed in @ref ETH_Fixed_Burst */
                       
    uint32_t             ETH_DMA_RxDMABurstLength;            /*!< Set the maximum number of beats to be transferred in one Rx DMA transaction
                                                                 detailed in @ref ETH_Rx_DMA_Burst_Length */ 

    uint32_t             ETH_DMA_TxDMABurstLength;            /*!< Set the maximum number of beats to be transferred in one Tx DMA transaction
                                                                 detailed in @ref ETH_Tx_DMA_Burst_Length */                                                   

    uint32_t             ETH_DMA_DescriptorSkipLength;        /*!< Set the number of word to skip between two descriptors only in Ring mode */                                                             

    uint32_t             ETH_DMA_Arbitration;                 /*!< Set the DMA Tx/Rx priority ratio
                                                                 detailed in @ref ETH_DMA_Arbitration */  
}ETH_InitPara;

/** 
  * @brief  ETH DMA Desciptors structure def
  */ 
typedef struct  
{
    uint32_t   Status;                /*!< Status */
    uint32_t   ControlBufferSize;     /*!< Control and Buffer1, Buffer2 lengths */
    uint32_t   Buffer1Addr;           /*!< Buffer1 address pointer */
    uint32_t   Buffer2NextDescAddr;   /*!< Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/**
  * @}
  */

/** @defgroup ETH_Exported_Constants
  * @{
  */ 

/** @defgroup ETH_delay_Def 
  * @{
  */
/* #define USE_Delay */

#ifdef USE_Delay
    #define _eth_delay_    Delay     /*!< User can provide more timing precise _eth_delay_ function */
#else
    #define _eth_delay_    ETH_Delay /*!< Default _eth_delay_ function with less precise timing */
#endif  

/**
  * @}
  */  

