LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_eth.h
/** @defgroup PHY_Reset_Delay 
  * @{
  */ 
#define PHY_RESETDELAY                                  ((uint32_t)0x000FFFFF) 

/**
  * @}
  */

/** @defgroup PHY_Config_Delay 
  * @{
  */ 
#define PHY_CONFIGDELAY                                 ((uint32_t)0x00FFFFFF)

/**
  * @}
  */

/** @defgroup PHY_Register_address 
  * @{
  */ 
#define PHY_BCR                                         0                  /*!< Tranceiver Basic Control Register */
#define PHY_BSR                                         1                  /*!< Tranceiver Basic Status Register */

/**
  * @}
  */

/** @defgroup PHY_basic_Control_register 
  * @{
  */ 
#define PHY_RESET                                       ((u16)0x8000)      /*!< PHY Reset */
#define PHY_LOOPBACK                                    ((u16)0x4000)      /*!< Enable loop-back mode */
#define PHY_FULLDUPLEX_100M                             ((u16)0x2100)      /*!< Configure speed to 100 Mb/s and the full-duplex mode */
#define PHY_HALFDUPLEX_100M                             ((u16)0x2000)      /*!< Configure speed to 100 Mb/s and the half-duplex mode */
#define PHY_FULLDUPLEX_10M                              ((u16)0x0100)      /*!< Configure speed to 10 Mb/s and the full-duplex mode */
#define PHY_HALFDUPLEX_10M                              ((u16)0x0000)      /*!< Configure speed to 10 Mb/s and the half-duplex mode */
#define PHY_AUTONEGOTIATION                             ((u16)0x1000)      /*!< Enable auto-negotiation function */
#define PHY_RESTART_AUTONEGOTIATION                     ((u16)0x0200)      /*!< Restart auto-negotiation function */
#define PHY_POWERDOWN                                   ((u16)0x0800)      /*!< Enable the power down mode */
#define PHY_ISOLATE                                     ((u16)0x0400)      /*!< Isolate PHY from MII */

/**
  * @}
  */

/** @defgroup PHY_basic_status_register 
  * @{
  */ 
#define PHY_AUTONEGO_COMPLETE                           ((u16)0x0020)      /*!< Auto-Negotioation process completed */
#define PHY_LINKED_STATUS                               ((u16)0x0004)      /*!< Valid link established */
#define PHY_JABBER_DETECTION                            ((u16)0x0002)      /*!< Jabber condition detected */

/**
  * @}
  */

/** @defgroup PHY_status_register 
  * @{
  */ 
/* The PHY status register value change with PHY in different Manufacturer
   so the user can use external PHY lib to update this value if PHY types user selected not included in firmware */
#if(PHY_TYPE == LAN8700) 
/** 
  * @brief  For LAN8700  
  */ 
#define PHY_SR                                          31                 /*!< Tranceiver Status Register */			
/* The Speed and Duplex mask values change with PHY in different Manufacturer
   so the user can use external PHY lib to update this value if PHY types user selected not included in firmware */
#define PHY_Speed_Status                                ((u16)0x0004) 	   /*!< Configured information of Speed: 10Mbps */
#define PHY_DUPLEX_STATUS                               ((u16)0x0010) 	   /*!< Configured information of Duplex: Full-duplex */

#elif(PHY_TYPE == DP83848)
/** 
  * @brief  For DP83848  
  */ 
#define PHY_SR                                          16     /*!< Tranceiver Status Register */
/* The Speed and Duplex mask values change with PHY in different Manufacturer
   so the user can use external PHY lib to update this value if PHY types user selected not included in firmware */
#define PHY_SPEED_STATUS                                ((u16)0x0002)      /*!< Configured information of Speed: 10Mbps */
#define PHY_DUPLEX_STATUS                               ((u16)0x0004)      /*!< Configured information of Duplex: Full-duplex */

#define PHY_Reset                                       PHY_RESETDELAY   
#define PHY_ResetDelay                                  PHY_RESETDELAY
#define PHY_Speed_Status                                PHY_SPEED_STATUS

#endif

#endif


/**
  * @}
  */ 

/** @defgroup ETH_AutoNegotiation 
  * @{
  */ 
#define ETH_AUTONEGOTIATION_ENABLE                      ((uint32_t)0x00000001)
#define ETH_AUTONEGOTIATION_DISABLE                     ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_watchdog 
  * @{
  */ 
#define ETH_WATCHDOG_ENABLE                             ((uint32_t)0x00000000)
#define ETH_WATCHDOG_DISABLE                            ((uint32_t)0x00800000)

/**
  * @}
  */

/** @defgroup ETH_Jabber 
  * @{
  */ 
#define ETH_JABBER_ENABLE                               ((uint32_t)0x00000000)
#define ETH_JABBER_DISABLE                              ((uint32_t)0x00400000)

/**
  * @}
  */

/** @defgroup ETH_Inter_Frame_Gap 
  * @{
  */ 
#define ETH_INTERFRAMEGAP_96BIT                         ((uint32_t)0x00000000)
#define ETH_INTERFRAMEGAP_88BIT                         ((uint32_t)0x00020000)
#define ETH_INTERFRAMEGAP_80BIT                         ((uint32_t)0x00040000)
#define ETH_INTERFRAMEGAP_72BIT                         ((uint32_t)0x00060000)
#define ETH_INTERFRAMEGAP_64BIT                         ((uint32_t)0x00080000)
#define ETH_INTERFRAMEGAP_56BIT                         ((uint32_t)0x000A0000)
#define ETH_INTERFRAMEGAP_48BIT                         ((uint32_t)0x000C0000)
#define ETH_INTERFRAMEGAP_40BIT                         ((uint32_t)0x000E0000)


/**
  * @}
  */

/** @defgroup ETH_Carrier_Sense 
  * @{
  */ 
#define ETH_CARRIERSENSE_ENABLE                         ((uint32_t)0x00000000)
#define ETH_CARRIERSENSE_DISABLE                        ((uint32_t)0x00010000)

/**
  * @}
  */

/** @defgroup ETH_Speed 
  * @{
  */ 
#define ETH_SPEEDMODE_10M                               ((uint32_t)0x00000000)
#define ETH_SPEEDMODE_100M                              ((uint32_t)0x00004000)

/**
  * @}
  */

/** @defgroup ETH_Receive_Own 
  * @{
  */ 
#define ETH_RECEIVEOWN_ENABLE                           ((uint32_t)0x00000000)
#define ETH_RECEIVEOWN_DISABLE                          ((uint32_t)0x00002000)


/**
  * @}
  */

/** @defgroup ETH_Loop_Back_Mode 
  * @{
  */ 
#define ETH_LOOPBACKMODE_ENABLE                         ((uint32_t)0x00001000)
#define ETH_LOOPBACKMODE_DISABLE                        ((uint32_t)0x00000000)


/**
  * @}
  */

/** @defgroup ETH_Duplex_Mode 
  * @{
  */ 
#define ETH_MODE_FULLDUPLEX                             ((uint32_t)0x00000800)
#define ETH_MODE_HALFDUPLEX                             ((uint32_t)0x00000000)


/**
  * @}
  */

/** @defgroup ETH_Checksum_Offload 
  * @{
  */ 
#define ETH_CHECKSUMOFFLOAD_ENABLE                      ((uint32_t)0x00000400)
#define ETH_CHECKSUMOFFLOAD_DISABLE                     ((uint32_t)0x00000000)


/**
  * @}
  */

/** @defgroup ETH_Retry_Transmission 
  * @{
  */ 
#define ETH_RETRYTRANSMISSION_ENABLE                    ((uint32_t)0x00000000)
#define ETH_RETRYTRANSMISSION_DISABLE                   ((uint32_t)0x00000200)


/**
  * @}
  */

/** @defgroup ETH_Automatic_Pad_CRC_Drop 
  * @{
  */ 
#define ETH_AUTOMATICPADCRCDROP_ENABLE                  ((uint32_t)0x00000080)
#define ETH_AUTOMATICPADCRCDROP_DISABLE                 ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Back_Off_Limit 
  * @{
  */ 
#define ETH_BACKOFFLIMIT_10                             ((uint32_t)0x00000000)
#define ETH_BACKOFFLIMIT_8                              ((uint32_t)0x00000020)
#define ETH_BACKOFFLIMIT_4                              ((uint32_t)0x00000040)
#define ETH_BACKOFFLIMIT_1                              ((uint32_t)0x00000060)

/**
  * @}
  */

