LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_eth.h
/** @defgroup ETH_DMA_Flags 
  * @{
  */ 
#define ETH_DMA_FLAG_TST                                ((uint32_t)0x20000000)  /*!< Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_FLAG_WUM                                ((uint32_t)0x10000000)  /*!< WUM interrupt (on DMA) */
#define ETH_DMA_FLAG_MSC                                ((uint32_t)0x08000000)  /*!< MSC interrupt (on DMA) */
#define ETH_DMA_FLAG_DATATRANSFERERROR                  ((uint32_t)0x00800000)      /*!< Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMA_FLAG_READWRITEERROR                     ((uint32_t)0x01000000)      /*!< Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMA_FLAG_ACCESSERROR                        ((uint32_t)0x02000000)      /*!< Error bits 0-data buffer, 1-desc. access */
#define ETH_DMA_FLAG_NIS                                ((uint32_t)0x00010000)  /*!< Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS                                ((uint32_t)0x00008000)  /*!< Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ER                                 ((uint32_t)0x00004000)  /*!< Early receive flag */
#define ETH_DMA_FLAG_FBE                                ((uint32_t)0x00002000)  /*!< Fatal bus error flag */
#define ETH_DMA_FLAG_ET                                 ((uint32_t)0x00000400)  /*!< Early transmit flag */
#define ETH_DMA_FLAG_RWT                                ((uint32_t)0x00000200)  /*!< Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RPS                                ((uint32_t)0x00000100)  /*!< Receive process stopped flag */
#define ETH_DMA_FLAG_RBU                                ((uint32_t)0x00000080)  /*!< Receive buffer unavailable flag */
#define ETH_DMA_FLAG_R                                  ((uint32_t)0x00000040)  /*!< Receive flag */
#define ETH_DMA_FLAG_TU                                 ((uint32_t)0x00000020)  /*!< Transmit Underflow flag */
#define ETH_DMA_FLAG_RO                                 ((uint32_t)0x00000010)  /*!< Receive Overflow flag */
#define ETH_DMA_FLAG_TJT                                ((uint32_t)0x00000008)  /*!< Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TBU                                ((uint32_t)0x00000004)  /*!< Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TPS                                ((uint32_t)0x00000002)  /*!< Transmit process stopped flag */
#define ETH_DMA_FLAG_T                                  ((uint32_t)0x00000001)  /*!< Transmit flag */

/**
  * @}
  */

/** @defgroup ETH_DMA_Interrupts 
  * @{
  */ 
#define ETH_DMA_INT_TST                                  ((uint32_t)0x20000000)  /*!< Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_INT_WUM                                  ((uint32_t)0x10000000)  /*!< WUM interrupt (on DMA) */
#define ETH_DMA_INT_MSC                                  ((uint32_t)0x08000000)  /*!< MSC interrupt (on DMA) */
#define ETH_DMA_INT_NIS                                  ((uint32_t)0x00010000)  /*!< Normal interrupt summary */
#define ETH_DMA_INT_AIS                                  ((uint32_t)0x00008000)  /*!< Abnormal interrupt summary */
#define ETH_DMA_INT_ER                                   ((uint32_t)0x00004000)  /*!< Early receive interrupt */
#define ETH_DMA_INT_FBE                                  ((uint32_t)0x00002000)  /*!< Fatal bus error interrupt */
#define ETH_DMA_INT_ET                                   ((uint32_t)0x00000400)  /*!< Early transmit interrupt */
#define ETH_DMA_INT_RWT                                  ((uint32_t)0x00000200)  /*!< Receive watchdog timeout interrupt */
#define ETH_DMA_INT_RPS                                  ((uint32_t)0x00000100)  /*!< Receive process stopped interrupt */
#define ETH_DMA_INT_RBU                                  ((uint32_t)0x00000080)  /*!< Receive buffer unavailable interrupt */
#define ETH_DMA_INT_R                                    ((uint32_t)0x00000040)  /*!< Receive interrupt */
#define ETH_DMA_INT_TU                                   ((uint32_t)0x00000020)  /*!< Transmit Underflow interrupt */
#define ETH_DMA_INT_RO                                   ((uint32_t)0x00000010)  /*!< Receive Overflow interrupt */
#define ETH_DMA_INT_TJT                                  ((uint32_t)0x00000008)  /*!< Transmit jabber timeout interrupt */
#define ETH_DMA_INT_TBU                                  ((uint32_t)0x00000004)  /*!< Transmit buffer unavailable interrupt */
#define ETH_DMA_INT_TPS                                  ((uint32_t)0x00000002)  /*!< Transmit process stopped interrupt */
#define ETH_DMA_INT_T                                    ((uint32_t)0x00000001)  /*!< Transmit interrupt */


/**
  * @}
  */

/** @defgroup ETH_DMA_transmit_process_state_ 
  * @{
  */ 
#define ETH_DMA_TRANSMITPROCESS_STOPPED                 ((uint32_t)0x00000000)
#define ETH_DMA_TRANSMITPROCESS_FETCHING                ((uint32_t)0x00100000)
#define ETH_DMA_TRANSMITPROCESS_WAITING                 ((uint32_t)0x00200000)
#define ETH_DMA_TRANSMITPROCESS_READING                 ((uint32_t)0x00300000)
#define ETH_DMA_TRANSMITPROCESS_SUSPENDED               ((uint32_t)0x00600000)
#define ETH_DMA_TRANSMITPROCESS_CLOSING                 ((uint32_t)0x00700000)

/**
  * @}
  */ 


/** @defgroup ETH_DMA_receive_process_state_ 
  * @{
  */ 
#define ETH_DMA_RECEIVEPROCESS_STOPPED                  ((uint32_t)0x00000000)
#define ETH_DMA_RECEIVEPROCESS_FETCHING                 ((uint32_t)0x00020000)
#define ETH_DMA_RECEIVEPROCESS_WAITING                  ((uint32_t)0x00060000)
#define ETH_DMA_RECEIVEPROCESS_SUSPENDED                ((uint32_t)0x00080000)
#define ETH_DMA_RECEIVEPROCESS_CLOSING                  ((uint32_t)0x000A0000)
#define ETH_DMA_RECEIVEPROCESS_QUEUING                  ((uint32_t)0x000E0000)

/**
  * @}
  */

/** @defgroup ETH_DMA_overflow_ 
  * @{
  */ 
#define ETH_DMA_OVERFLOW_RXFIFOCOUNTER                  ((uint32_t)0x10000000)
#define ETH_DMA_OVERFLOW_MISSEDFRAMECOUNTER             ((uint32_t)0x00010000)

/**
  * @}
  */

/** @defgroup ETH_WUM_Flags 
  * @{
  */ 
#define ETH_WUM_FLAG_WUFFRPR                            ((uint32_t)0x80000000)  /*!< Wake-Up Frame Filter Register Poniter Reset */
#define ETH_WUM_FLAG_WUFR                               ((uint32_t)0x00000040)  /*!< Wake-Up Frame Received */
#define ETH_WUM_FLAG_MPKR                               ((uint32_t)0x00000020)  /*!< Magic Packet Received */

/**
  * @}
  */

/** @defgroup ETH_MSC_Tx_Interrupts 
  * @{
  */ 
#define ETH_MSC_INT_TGF                                  ((uint32_t)0x00200000)  /*!< When Tx good frame counter reaches half the maximum value */
#define ETH_MSC_INT_TGFMSC                               ((uint32_t)0x00008000)  /*!< When Tx good multi col counter reaches half the maximum value */
#define ETH_MSC_INT_TGFSC                                ((uint32_t)0x00004000)  /*!< When Tx good single col counter reaches half the maximum value */

/**
  * @}
  */

/** @defgroup ETH_MSC_Rx_Interrupts 
  * @{
  */
#define ETH_MSC_INT_RGUF                                 ((uint32_t)0x10020000)  /*!< When Rx good unicast frames counter reaches half the maximum value */
#define ETH_MSC_INT_RFAE                                 ((uint32_t)0x10000040)  /*!< When Rx alignment error counter reaches half the maximum value */
#define ETH_MSC_INT_RFCE                                 ((uint32_t)0x10000020)  /*!< When Rx crc error counter reaches half the maximum value */
/**
  * @}
  */

/** @defgroup ETH_MSC_Registers 
  * @{
  */ 
#define ETH_MSC_CTLR                                    ((uint32_t)0x00000100)
#define ETH_MSC_RISR                                    ((uint32_t)0x00000104)
#define ETH_MSC_TISR                                    ((uint32_t)0x00000108)
#define ETH_MSC_RIMR                                    ((uint32_t)0x0000010C)
#define ETH_MSC_TIMR                                    ((uint32_t)0x00000110)
#define ETH_MSC_SCCNT                                   ((uint32_t)0x0000014C)
#define ETH_MSC_MSCCNT                                  ((uint32_t)0x00000150) 
#define ETH_MSC_TGFCNT                                  ((uint32_t)0x00000168)
#define ETH_MSC_RFCECNT                                 ((uint32_t)0x00000194)
#define ETH_MSC_RFAECNT                                 ((uint32_t)0x00000198)
#define ETH_MSC_RGUFCNT                                 ((uint32_t)0x000001C4)


/**
  * @}
  */

/** @defgroup ETH_PTP_time_update_mode 
  * @{
  */ 
#define ETH_PTP_FINEMODE                                ((uint32_t)0x00000001)
#define ETH_PTP_COARSEMODE                              ((uint32_t)0x00000000)

/**
  * @}
  */ 


/** @defgroup ETH_PTP_Flags 
  * @{
  */ 
#define ETH_PTP_FLAG_TMSARU                             ((uint32_t)0x00000020)  /*!< Addend Register Update */
#define ETH_PTP_FLAG_TMSITEN                            ((uint32_t)0x00000010)  /*!< Time Stamp Interrupt Trigger Enable */
#define ETH_PTP_FLAG_TMSSTU                             ((uint32_t)0x00000008)  /*!< Time Stamp Update */
#define ETH_PTP_FLAG_TMSSTI                             ((uint32_t)0x00000004)  /*!< Time Stamp Initialize */

/**
  * @}
  */

/** @defgroup ETH_PTP_time_sign 
  * @{
  */ 
#define ETH_PTP_POSITIVETIME                            ((uint32_t)0x00000000)
#define ETH_PTP_NEGATIVETIME                            ((uint32_t)0x80000000)
  
/** 
  * @brief  ETH PTP registers  
  */ 
#define ETH_PTP_TSCTLR                                  ((uint32_t)0x00000700)
#define ETH_PTP_SSINCR                                  ((uint32_t)0x00000704)
#define ETH_PTP_TMSHR                                   ((uint32_t)0x00000708)
#define ETH_PTP_TMSLR                                   ((uint32_t)0x0000070C)
#define ETH_PTP_TMSHUR                                  ((uint32_t)0x00000710)
#define ETH_PTP_TMSLUR                                  ((uint32_t)0x00000714)
#define ETH_PTP_TSACNT                                  ((uint32_t)0x00000718)
#define ETH_PTP_ETHR                                    ((uint32_t)0x0000071C)
#define ETH_PTP_ETLR                                    ((uint32_t)0x00000720)

/**
  * @}
  */ 


/**
  * @}
  */
  

/** @defgroup ETH_Exported_Functions
  * @{
  */ 
void ETH_DeInit(void);
void ETH_MDIOInit(void);
uint32_t ETH_Init(ETH_InitPara* ETH_InitParaStruct, u16 PHYAddress);
void ETH_ParaInit(ETH_InitPara* ETH_InitParaStruct);
void ETH_SoftReset(void);
TypeState ETH_GetSoftResetStatus(void);
void ETH_Enable(TypeState NewValue);
uint32_t ETH_HandleTxPkt(uint8_t *pbuf, uint16_t size);
uint32_t ETH_HandleRxPkt(uint8_t *pbuf);
uint32_t ETH_GetRxPktSize(void);
void ETH_DropRxPkt(void);
/** 
  * @brief  PHY  
  */ 
uint16_t ETH_GetPHYRegisterValue(uint16_t PHYAddr, uint16_t PHYReg);
uint32_t ETH_SetPHYRegisterValue(uint16_t PHYAddr, uint16_t PHYReg, uint16_t PHYValue);
uint32_t ETH_PHYLoopBack_Enable(uint16_t PHYAddr, TypeState NewValue);

/** 
  * @brief  MAC  
  */ 
void ETH_MACTransmission_Enable(TypeState NewValue);
void ETH_MACReception_Enable(TypeState NewValue);
TypeState ETH_GetFlowControlBusyBitState(void);
void ETH_PauseFrameInit(void)  ;
void ETH_BackPressureActivation_Enable(TypeState NewValue);   
TypeState ETH_GetMACBitState(uint32_t ETH_MAC_FLAG);
TypeState ETH_GetMACIntBitState(uint32_t ETH_MAC_IT);
void ETH_MACINTConfig(uint32_t ETH_MAC_IT, TypeState NewValue);
void ETH_SetMACAddress(uint32_t addr, uint8_t *buf);
void ETH_GetMACAddress(uint32_t addr, uint8_t *buf);
void ETH_MACAddressPerfectFilter_Enable(uint32_t addr, TypeState NewValue);
void ETH_MACAddressFilterConfig(uint32_t addr, uint32_t Filterfield);
void ETH_MACAddressFilterMaskBytesConfig(uint32_t addr, uint32_t addrmask);

/** 
  * @brief  DMA Tx/Rx descriptors  
  */ 
void ETH_DMATxDescChainModeInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t* pTxBuff, uint32_t TxBuffCnt);
void ETH_DMATxDescRingModeInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t *pTxBuff1, uint8_t *pTxBuff2, uint32_t TxBuffCnt);
TypeState ETH_GetDMATxDescBitState(ETH_DMADESCTypeDef *DMATxDesc, uint32_t ETH_DMATxDescFlag);
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc);
void ETH_SetDMATxDescBusyBit(ETH_DMADESCTypeDef *DMATxDesc);
void ETH_DMATxDescTransmitINTConfig(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_SetDMATxDescFrameSegment(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Segment);
void ETH_SetDMATxDescChecksumInsertion(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Checksum);
void ETH_DMATxDescCRC_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_DMATxDescEndOfRing_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_DMATxDescSecondAddressChained_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_DMATxDescShortFramePadding_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_DMATxDescTimeStamp_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue);
void ETH_SetDMATxDescBufferSize(ETH_DMADESCTypeDef *DMATxDesc, uint32_t Buffer1Size, uint32_t Buffer2Size);
void ETH_DMARxDescChainModeInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *pRxBuff, uint32_t RxBuffCnt);
void ETH_DMARxDescRingModeInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *pRxBuff1, uint8_t *pRxBuff2, uint32_t RxBuffCnt);
TypeState ETH_GetDMARxDescBitState(ETH_DMADESCTypeDef *DMARxDesc, uint32_t ETH_DMARxDescFlag);
void ETH_SetDMARxDescBusyBit(ETH_DMADESCTypeDef *DMARxDesc);
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc);
void ETH_DMARxDescReceiveINTConfig(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue);
void ETH_DMARxDescEndOfRing_Enable(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue);
void ETH_DMARxDescSecondAddressChained_Enable(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue);
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc, uint32_t DMARxDesc_Buffer);

/** 
  * @brief  DMA
  */ 
TypeState ETH_GetDMABitState(uint32_t ETH_DMA_FLAG);
void ETH_DMAClearBitState(uint32_t ETH_DMA_FLAG);
TypeState ETH_GetDMAIntBitState(uint32_t ETH_DMA_IT);
void ETH_DMAClearIntBitState(uint32_t ETH_DMA_IT);
uint32_t ETH_GetTransmitProcessState(void);
uint32_t ETH_GetReceiveProcessState(void);
void ETH_CleanTransmitFIFO(void);
TypeState ETH_GetFlushTransmitFIFOStatus(void);
void ETH_DMATransmission_Enable(TypeState NewValue);
void ETH_DMAReception_Enable(TypeState NewValue);
void ETH_DMAINTConfig(uint32_t ETH_DMA_IT, TypeState NewValue);
TypeState ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow);
uint32_t ETH_GetRxOverflowMissedFrameCounter(void);
uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void);
uint32_t ETH_GetCurrentTxDescStartAddress(void);
uint32_t ETH_GetCurrentRxDescStartAddress(void);
uint32_t ETH_GetCurrentTxBufferAddress(void);
uint32_t ETH_GetCurrentRxBufferAddress(void);
void ETH_ResumeDMATransmission(void);
void ETH_ResumeDMAReception(void);

/** 
  * @brief  WUM  
  */ 
void ETH_ResetWakeUpFrameFilterRegister(void);
void ETH_SetWakeUpFrameFilterRegister(uint32_t *pBuffer);
void ETH_GlobalUnicastWakeUp_Enable(TypeState NewValue);
TypeState ETH_GetWUMBitState(uint32_t ETH_WUM_FLAG);
void ETH_WakeUpFrameDetection_Enable(TypeState NewValue);
void ETH_MagicPacketDetection_Enable(TypeState NewValue);
void ETH_PowerDown_Enable(TypeState NewValue);

/** 
  * @brief  MSC  
  */ 
void ETH_MSCCounterFreeze_Enable(TypeState NewValue);
void ETH_MSCResetOnRead_Enable(TypeState NewValue);
void ETH_MSCCounterRollover_Enable(TypeState NewValue);
void ETH_ResetMSCCounters(void);
void ETH_MSCINTConfig(uint32_t ETH_MSC_IT, TypeState NewValue);
TypeState ETH_GetMSCINTStatus(uint32_t ETH_MSC_IT);
uint32_t ETH_GetMSCRegister(uint32_t ETH_MSC_Register);

/** 
  * @brief  PTP  
  */ 
void ETH_PTPTimeStampAddendUpdate(void);
void ETH_PTPTimeStampIntTrigger_Enable(TypeState NewValue);
void ETH_PTPTimeStampUpdate_Enable(TypeState NewValue);
void ETH_PTPTimeStampInit(void);
void ETH_PTPUpdateModeConfig(uint32_t UpdateMode);
void ETH_PTPTimeStamp_Enable(TypeState NewValue);
TypeState ETH_GetPTPBitState(uint32_t ETH_PTP_FLAG);
void ETH_SetPTPSubSecondIncrement(uint32_t SubSecond);
void ETH_SetPTPUpdateTimeValue(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue);
void ETH_SetPTPTimeStampAddend(uint32_t add);
void ETH_SetPTPTargetTime(uint32_t HighReg_Value, uint32_t LowReg_Value);
uint32_t ETH_GetPTPRegister(uint32_t ETH_PTPRegister);
void ETH_DMAPTPTxDescChainModeInit(ETH_DMADESCTypeDef *DMATxDescTab, ETH_DMADESCTypeDef *DMAPTPTxDescTab,
                               uint8_t* pTxBuff, uint32_t TxBuffCnt);
void ETH_DMAPTPRxDescChainModeInit(ETH_DMADESCTypeDef *DMARxDescTab, ETH_DMADESCTypeDef *DMAPTPRxDescTab,
                               uint8_t *pRxBuff, uint32_t RxBuffCnt);
uint32_t ETH_HandlePTPTxPkt(uint8_t *pbuf, uint16_t size, uint32_t *PTPTxTab);
uint32_t ETH_HandlePTPRxPkt(uint8_t *pbuf, uint32_t *PTPRxTab);


#ifdef __cplusplus
}
#endif

#endif /* __GD32F20X_ETH_H */

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/
